In [40]:
import pandas as pd

In [41]:
data = {
    'Name':['Pawan','Ragiv','Lalit','Ishan','Rohit'],
    'Age':[25,None,44,23,None],
    'Salary':[50000,60000,70000,None,None]
}

In [42]:
df = pd.DataFrame(data)

In [43]:
df

    Name   Age   Salary
0  Pawan  25.0  50000.0
1  Ragiv   NaN  60000.0
2  Lalit  44.0  70000.0
3  Ishan  23.0      NaN
4  Rohit   NaN      NaN

In [44]:
null_data = df.isnull().sum()
null_data

Name      0
Age       2
Salary    2
dtype: int64

In [45]:
drop_df = df.dropna()
drop_df

    Name   Age   Salary
0  Pawan  25.0  50000.0
2  Lalit  44.0  70000.0

In [49]:
df['Age'].fillna(df["Age"].mean(),inplace=True)
df['Salary'].fillna(df["Salary"].mean(),inplace=True)

C:\Users\91838\AppData\Local\Temp\ipykernel_11344\3926192818.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df["Age"].mean(),inplace=True)
C:\Users\91838\AppData\Local\Temp\ipykernel_11344\3926192818.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df["Salary"].mean(),inplace=True)

In [50]:
df

    Name        Age   Salary
0  Pawan  25.000000  50000.0
1  Ragiv  30.666667  60000.0
2  Lalit  44.000000  70000.0
3  Ishan  23.000000  60000.0
4  Rohit  30.666667  60000.0